---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairstypeIntermediateSupportType
source: html/f22dea9f-5a64-1d4b-3a85-d0960c12eac8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairstypeIntermediateSupportType Property

"Middle Support Type": Intermediate Support Type

## Syntax (C#)
```csharp
public static ForgeTypeId StairstypeIntermediateSupportType { get; }
```